# imgur key
client_id = '9dbe76c69af5489'
client_secret = 'b34838057c99d05b97e433dda73976c1727cf4ae'
album_id = 'wuYFjwf'#0bIsRbS
access_token = '3262520325f32d484f02009e34491aab4ba42507'
refresh_token = 'd4a1fd24541add0b69475d718fa428e53c7c06c9'

# line bot key
line_channel_access_token = '8NDvVLUVZqlsmuVRXT0BcD2Qv8CDCXfCF/JCnsw7sla2ZV/HzgdYiMxJIjNKbEChLivFSlzZVmEVzGqmERk1sMcBoIqBqrrTQ35+PkQYJcKBSXoerddVUNcseYxBVGFSq8RD6dEtGwSl23mmr/r7eQdB04t89/1O/w1cDnyilFU='
line_channel_secret = 'a5ccb4720386225cccbe5f66d1c9978d'
uesr_name_myself = {
'U52dfc11c1bfc683323591e9093c16b6d':'慶哥',#永慶
'Uf3195a3c5cc538e9e58d1f0031091bba':'均哥',#建均
'Uc83e9226ace83e452c8fe5ee79ed8ed3':'威哥',#威頣
'U466edffe1cbbc77a9efde0c612ea34a0':'博哥',#建博
'U9f1352695f6b209a738c248087843202':'鈺哥',#鈺鏵
'Uafda8f7a900d2a3ac5e0f203f2f9d14a':'賢哥',#俊賢
'U7262f5fc768887475f2a9baf97d23b1e':'軒哥',#俊軒
'Ud29be03aef3ec3478d8a8366db7fc9de':'Carlos Huang',#賢能
'Uc607ab2ccc4ac029f44b743c7b1338bc':'勇男',
'U111817bb3803a6414e1aa7ae9a181bd3':'展哥',#明展
'U636ee51de9f33915584a7c55a2a63840':'滑倒又爬起來流出黃黃的東西',#聖華
'U1fdb9285e295e324ba2d572c93f8b3bb':'奇怪哥哥',#文琦
'U5c87de27af74e683eb96eb586a3867c3':'民哥',#宏民
}
taiwan_railway_station = {'基隆':'0900-基隆','三坑':'0910-三坑','八堵':'0920-八堵','七堵':'0930-七堵','百福':'0940-百福','五堵':'0950-五堵','汐止':'0960-汐止','汐科':'0970-汐科','南港':'0980-南港','松山':'0990-松山','台北':'1000-臺北','台北-環島':'1001-臺北-環島','萬華':'1010-萬華','板橋':'1020-板橋','浮洲':'1030-浮洲','樹林':'1040-樹林','南樹林':'1050-南樹林','山佳':'1060-山佳','鶯歌':'1070-鶯歌','桃園':'1080-桃園','內壢':'1090-內壢','中壢':'1100-中壢','埔心':'1110-埔心','楊梅':'1120-楊梅','富岡':'1130-富岡','新富':'1140-新富','北湖':'1150-北湖','湖口':'1160-湖口','新豐':'1170-新豐','竹北':'1180-竹北','北新竹':'1190-北新竹','千甲':'1191-千甲','新莊':'1192-新莊','竹中':'1193-竹中','六家':'1194-六家','上員':'1201-上員','榮華':'1202-榮華','竹東':'1203-竹東','橫山':'1204-橫山','九讚頭':'1205-九讚頭','合興':'1206-合興','富貴':'1207-富貴','內灣':'1208-內灣','新竹':'1210-新竹','三姓橋':'1220-三姓橋','香山':'1230-香山','崎頂':'1240-崎頂','竹南':'1250-竹南','談文':'2110-談文','大山':'2120-大山','後龍':'2130-後龍','龍港':'2140-龍港','白沙屯':'2150-白沙屯','新埔':'2160-新埔','通霄':'2170-通霄','苑裡':'2180-苑裡','日南':'2190-日南','大甲':'2200-大甲','台中港':'2210-臺中港','清水':'2220-清水','沙鹿':'2230-沙鹿','龍井':'2240-龍井','大肚':'2250-大肚','追分':'2260-追分','造橋':'3140-造橋','豐富':'3150-豐富','苗栗':'3160-苗栗','南勢':'3170-南勢','銅鑼':'3180-銅鑼','三義':'3190-三義','泰安':'3210-泰安','后里':'3220-后里','豐原':'3230-豐原','栗林':'3240-栗林','潭子':'3250-潭子','頭家 厝':'3260-頭家 厝','松竹':'3270-松竹','太原':'3280-太原','精武':'3290-精武','台中':'3300-臺中','五權':'3310-五權','大慶':'3320-大慶','烏日':'3330-烏日','新烏日':'3340-新烏日','成功':'3350-成功','彰化':'3360-彰化','花壇':'3370-花壇','大村':'3380-大村','員林':'3390-員林','永靖':'3400-永靖','社頭':'3410-社頭','田中':'3420-田中','二水':'3430-二水','源泉':'3431-源泉','濁水':'3432-濁水','龍泉':'3433-龍泉','集集':'3434-集集','水里':'3435-水里','車埕':'3436-車埕','林內':'3450-林內','石榴':'3460-石榴','斗六':'3470-斗六','斗南':'3480-斗南','石龜':'3490-石龜','大林':'4050-大林','民雄':'4060-民雄','嘉北':'4070-嘉北','嘉義':'4080-嘉義','水上':'4090-水上','南靖':'4100-南靖','後壁':'4110-後壁','新營':'4120-新營','柳營':'4130-柳營','林鳳營':'4140-林鳳營','隆田':'4150-隆田','拔林':'4160-拔林','善化':'4170-善化','南科':'4180-南科','新市':'4190-新市','永康':'4200-永康','大橋':'4210-大橋','台南':'4220-臺南','保安':'4250-保安','仁德':'4260-仁德','中洲':'4270-中洲','長榮大學':'4271-長榮大學','沙崙':'4272-沙崙','大湖':'4290-大湖','路竹':'4300-路竹','岡山':'4310-岡山','橋頭':'4320-橋頭','楠梓':'4330-楠梓','新左營':'4340-新左營','左營':'4350-左營','內惟':'4360-內惟','美術館':'4370-美術館','鼓山':'4380-鼓山','三塊厝':'4390-三塊厝','高雄':'4400-高雄','民族':'4410-民族','科工館':'4420-科工館','正義':'4430-正義','鳳山':'4440-鳳山','後庄':'4450-後庄','九曲堂':'4460-九曲堂','六塊厝':'4470-六塊厝','屏東':'5000-屏東', '歸來':'5010-歸來', '麟洛':'5020-麟洛', '西勢':'5030-西勢', '竹田':'5040-竹田', '潮州':'5050-潮州', '崁頂':'5060-崁頂', '南州':'5070-南州', '鎮安':'5080-鎮安', '林邊':'5090-林邊', '佳冬':'5100-佳冬', '東海':'5110-東海', '枋寮':'5120-枋寮', '加祿':'5130-加祿', '內獅':'5140-內獅', '枋山':'5160-枋山', '大武':'5190-大武', '瀧溪':'5200-瀧溪', '金崙':'5210-金崙', '太麻里':'5220-太麻里', '知本':'5230-知本', '康樂':'5240-康樂', '台東':'6000-臺東', '山里':'6010-山里', '鹿野':'6020-鹿野', '瑞源':'6030-瑞源', '瑞和':'6040- 瑞和', '關山':'6050-關山', '海端':'6060-海端', '池上':'6070-池上', '富里':'6080-富里', '東竹':'6090-東竹', '東里':'6100-東里', '玉里':'6110-玉里', '三民':'6120-三民', '瑞穗':'6130-瑞穗', '富源':'6140-富源', '大富':'6150-大富', '光復':'6160-光復', '萬榮':'6170-萬榮', '鳳林':'6180-鳳林', '南平':'6190-南平', '林榮新光':'6200-林榮新光', '豐田':'6210-豐田', '壽豐':'6220-壽豐', '平和':'6230-平和', '志學':'6240-志學', '吉安':'6250-吉安', '花蓮':'7000-花蓮', '北埔':'7010-北埔', '景美':'7020-景美', '新城':'7030-新城', '崇德':'7040-崇德', '和仁':'7050-和仁', '和平':'7060-和平', '漢本':'7070-漢本', '武塔':'7080-武塔', '南澳':'7090-南澳', '東澳':'7100-東澳', '永樂':'7110-永樂', '蘇澳':'7120-蘇澳', '蘇澳新':'7130-蘇澳新', '新馬':'7140-新馬', '冬山':'7150-冬山', '羅東':'7160-羅東', '中里':'7170-中里', '二結':'7180-二結', '宜蘭':'7190-宜蘭', '四城':'7200-四城', '礁溪':'7210-礁溪', '頂埔':'7220-頂埔', '頭城':'7230-頭城', '外澳':'7240-外澳', '龜山':'7250-龜山', '大溪':'7260-大溪', '大里':'7270-大里', '石城':'7280-石城', '福隆':'7290-福隆', '貢寮':'7300-貢寮', '雙溪':'7310-雙溪', '牡丹':'7320-牡丹', '三貂嶺':'7330-三貂嶺', '大華':'7331-大華', '十分':'7332-十分', '望古':'7333-望古', '嶺腳':'7334-嶺腳', '平溪':'7335-平溪', '菁桐':'7336-菁桐', '猴硐':'7350-猴硐', '瑞芳':'7360-瑞芳', '海科館':'7361-海科館', '八斗子':'7362-八斗子', '四腳亭':'7380-四腳亭', '暖暖':'7390-暖暖'}

thsrc_station = { '南港':'NanGang', '台北':'TaiPei', '板橋':'BanQiao', '桃園':'TaoYuan', '新竹':'XinZhu', '苗栗':'MiaoLi', '台中':'TaiZhong', '彰化':'ZhangHua', '雲林':'YunLin', '嘉義':'JiaYi', '台南':'TaiNan', '左營':'ZuoYing'}
